app/Controllers/Home.php

    public function showData(){
        if(! session()->get('logged_in')){
            // maka redirct ke halaman login

            echo view('login');
        }else{
            $this->db=db_connect();
            $builder=$this->db->table('data_keluarga');
            $builder->where('KD_USER', session()->get('user_name'));
            $query=$builder->get();
---
SELECT *
FROM `ci_data_keluarga`
WHERE `KD_USER` = 'yoyo'